; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_21)

(:domain logistics)

(:objects
	obj0 obj4 obj7 - airport
	obj1 obj5 obj8 - city
	obj2 obj3 obj6 obj18 obj20 obj21 - location
	obj9 obj10 obj11 obj12 - truck
	obj13 obj14 obj15 obj16 obj19 - package
	obj17 obj22 - airplane
)

(:init
	(at obj9 obj4)
	(at obj10 obj7)
	(at obj11 obj0)
	(at obj12 obj2)
	(at obj13 obj4)
	(at obj14 obj0)
	(at obj15 obj0)
	(at obj16 obj7)
	(at obj17 obj0)
	(at obj19 obj4)
	(at obj22 obj7)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj1)
	(in-city obj4 obj5)
	(in-city obj6 obj5)
	(in-city obj7 obj8)
	(in-city obj18 obj8)
	(in-city obj20 obj1)
	(in-city obj21 obj1)
)

(:goal (and
	(at obj13 obj18)
	(at obj14 obj18)
	(at obj15 obj0)
	(at obj16 obj6)
	(at obj19 obj7)
))
)

; plan
1. (drive obj11 obj0 obj2)
   deleted: (at obj11 obj0)
   added: (at obj11 obj2)
   goals met: 1 of 5
2. (load obj17 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj17)
   goals met: 1 of 5
3. (load obj22 obj16 obj7)
   deleted: (at obj16 obj7)
   added: (in obj16 obj22)
   goals met: 1 of 5
4. (fly obj17 obj0 obj4)
   deleted: (at obj17 obj0)
   added: (at obj17 obj4)
   goals met: 1 of 5
5. (fly obj22 obj7 obj0)
   deleted: (at obj22 obj7)
   added: (at obj22 obj0)
   goals met: 1 of 5
6. (drive obj12 obj2 obj3)
   deleted: (at obj12 obj2)
   added: (at obj12 obj3)
   goals met: 1 of 5
7. (fly obj22 obj0 obj4)
   deleted: (at obj22 obj0)
   added: (at obj22 obj4)
   goals met: 1 of 5
8. (load obj17 obj13 obj4)
   deleted: (at obj13 obj4)
   added: (in obj13 obj17)
   goals met: 1 of 5
9. (load obj17 obj19 obj4)
   deleted: (at obj19 obj4)
   added: (in obj19 obj17)
   goals met: 1 of 5
10. (fly obj17 obj4 obj7)
   deleted: (at obj17 obj4)
   added: (at obj17 obj7)
   goals met: 1 of 5
11. (drive obj11 obj2 obj21)
   deleted: (at obj11 obj2)
   added: (at obj11 obj21)
   goals met: 1 of 5
12. (drive obj12 obj3 obj20)
   deleted: (at obj12 obj3)
   added: (at obj12 obj20)
   goals met: 1 of 5
13. (unload obj17 obj13 obj7)
   deleted: (in obj13 obj17)
   added: (at obj13 obj7)
   goals met: 1 of 5
14. (unload obj17 obj14 obj7)
   deleted: (in obj14 obj17)
   added: (at obj14 obj7)
   goals met: 1 of 5
15. (unload obj22 obj16 obj4)
   deleted: (in obj16 obj22)
   added: (at obj16 obj4)
   goals met: 1 of 5
16. (fly obj17 obj7 obj4)
   deleted: (at obj17 obj7)
   added: (at obj17 obj4)
   goals met: 1 of 5
17. (fly obj22 obj4 obj7)
   deleted: (at obj22 obj4)
   added: (at obj22 obj7)
   goals met: 1 of 5
18. (drive obj11 obj21 obj20)
   deleted: (at obj11 obj21)
   added: (at obj11 obj20)
   goals met: 1 of 5
19. (drive obj12 obj20 obj3)
   deleted: (at obj12 obj20)
   added: (at obj12 obj3)
   goals met: 1 of 5
20. (fly obj17 obj4 obj7)
   deleted: (at obj17 obj4)
   added: (at obj17 obj7)
   goals met: 1 of 5
21. (fly obj22 obj7 obj0)
   deleted: (at obj22 obj7)
   added: (at obj22 obj0)
   goals met: 1 of 5
22. (load obj10 obj13 obj7)
   deleted: (at obj13 obj7)
   added: (in obj13 obj10)
   goals met: 1 of 5
23. (load obj10 obj14 obj7)
   deleted: (at obj14 obj7)
   added: (in obj14 obj10)
   goals met: 1 of 5
24. (load obj9 obj16 obj4)
   deleted: (at obj16 obj4)
   added: (in obj16 obj9)
   goals met: 1 of 5
25. (drive obj10 obj7 obj18)
   deleted: (at obj10 obj7)
   added: (at obj10 obj18)
   goals met: 1 of 5
26. (drive obj9 obj4 obj6)
   deleted: (at obj9 obj4)
   added: (at obj9 obj6)
   goals met: 1 of 5
27. (drive obj12 obj3 obj21)
   deleted: (at obj12 obj3)
   added: (at obj12 obj21)
   goals met: 1 of 5
28. (fly obj22 obj0 obj4)
   deleted: (at obj22 obj0)
   added: (at obj22 obj4)
   goals met: 1 of 5
29. (unload obj10 obj13 obj18)
   deleted: (in obj13 obj10)
   added: (at obj13 obj18)
   goals met: 2 of 5
30. (unload obj10 obj14 obj18)
   deleted: (in obj14 obj10)
   added: (at obj14 obj18)
   goals met: 3 of 5
31. (unload obj17 obj19 obj7)
   deleted: (in obj19 obj17)
   added: (at obj19 obj7)
   goals met: 4 of 5
32. (unload obj9 obj16 obj6)
   deleted: (in obj16 obj9)
   added: (at obj16 obj6)
   goals met: 5 of 5
